cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF32xM.xml
        <!-- REGISTER "EPFR11" -->
        <register>
          <name>EPFR11</name>
          <description>Extended pin function setting register 11</description>
          <addressOffset>0x62C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR12" -->
        <register>
          <name>EPFR12</name>
          <description>Extended pin function setting register 12</description>
          <addressOffset>0x630</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR13" -->
        <register>
          <name>EPFR13</name>
          <description>Extended pin function setting register 13</description>
          <addressOffset>0x634</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR14" -->
        <register>
          <name>EPFR14</name>
          <description>Extended pin function setting register 14</description>
          <addressOffset>0x638</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR15" -->
        <register>
          <name>EPFR15</name>
          <description>Extended pin function setting register 15</description>
          <addressOffset>0x63C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EINT23S" -->
            <field>
              <name>EINT23S</name>
              <description>External interrupt 23 input select bit</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT22S" -->
            <field>
              <name>EINT22S</name>
              <description>External interrupt 22 input select bit</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT21S" -->
            <field>
              <name>EINT21S</name>
              <description>External interrupt 21 input select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT20S" -->
            <field>
              <name>EINT20S</name>
              <description>External interrupt 20 input select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT19S" -->
            <field>
              <name>EINT19S</name>
              <description>External interrupt 19 input select bit</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT18S" -->
            <field>
              <name>EINT18S</name>
              <description>External interrupt 18 input select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT17S" -->
            <field>
              <name>EINT17S</name>
              <description>External interrupt 17 input select bit</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT16S" -->
            <field>
              <name>EINT16S</name>
              <description>External interrupt 16 input select bit</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR16" -->
        <register>
          <name>EPFR16</name>
          <description>Extended pin function setting register 16</description>
          <addressOffset>0x640</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR17" -->
        <register>
          <name>EPFR17</name>
          <description>Extended pin function setting register 17</description>
          <addressOffset>0x644</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR18" -->
        <register>
          <name>EPFR18</name>
          <description>Extended pin function setting register 18</description>
          <addressOffset>0x648</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PZR0" -->
        <register>
          <name>PZR0</name>
          <description>Port Pseudo Open Drain Setting Register 0</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001C00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of PZR0</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Bit11 of PZR0</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of PZR0</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PZR4" -->
        <register>
          <name>PZR4</name>
          <description>Port Pseudo Open Drain Setting Register 4</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Bit14 of PZR4</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description>Bit13 of PZR4</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of PZR4</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PZR6" -->
        <register>
          <name>PZR6</name>
          <description>Port Pseudo Open Drain Setting Register 6</description>
          <addressOffset>0x718</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PZR6</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
