cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF32xM.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "LVD" -->
    <peripheral>
      <name>LVD</name>
      <description>Low-voltage Detection</description>
      <groupName>LVD</groupName>
      <baseAddress>0x40035000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x5</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "LVD" -->
      <interrupt>
        <name>LVD</name>
        <value>2</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "LVD_CTL" -->
        <register>
          <name>LVD_CTL</name>
          <description>Low-voltage Detection Voltage Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8010</resetValue>
          <resetMask>0xFCFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDRE" -->
            <field>
              <name>LVDRE</name>
              <description>Low-voltage detection reset operation enable bit</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SVHR" -->
            <field>
              <name>SVHR</name>
              <description>Low-voltage detection reset voltage setting bits</description>
              <lsb>10</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LVDIE" -->
            <field>
              <name>LVDIE</name>
              <description>Low-voltage detection interrupt enable bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SVHI" -->
            <field>
              <name>SVHI</name>
              <description>Low-voltage detection interrupt voltage setting bits</description>
              <lsb>2</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_STR" -->
        <register>
          <name>LVD_STR</name>
          <description>Low-voltage Detection Interrupt Register</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x80</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDIR" -->
            <field>
              <name>LVDIR</name>
              <description>Low-voltage detection interrupt bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_CLR" -->
        <register>
          <name>LVD_CLR</name>
          <description>Low-voltage Detection Interrupt Clear Register</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0x80</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDCL" -->
            <field>
              <name>LVDCL</name>
              <description>Low-voltage detection interrupt clear bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_RLR" -->
        <register>
          <name>LVD_RLR</name>
          <description>Low-voltage Detection Voltage Protection Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDLCK" -->
            <field>
              <name>LVDLCK</name>
              <description>Low-voltage Detection Voltage Control Register protection bits</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_STR2" -->
        <register>
          <name>LVD_STR2</name>
          <description>Low-voltage Detection Circuit Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x40</resetValue>
          <resetMask>0xC0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDIRDY" -->
            <field>
              <name>LVDIRDY</name>
              <description>Low-voltage detection interrupt status flag</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LVDRRDY" -->
            <field>
              <name>LVDRRDY</name>
              <description>Low-voltage detection reset status flag</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "DS" -->
    <peripheral>
      <name>DS</name>
      <description>Low Power Consumption Mode</description>
      <groupName>DS</groupName>
      <baseAddress>0x40035100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x700</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x704</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x708</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x70C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x710</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x714</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x800</offset>
        <size>0x16</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "REG_CTL" -->
        <register>
          <name>REG_CTL</name>
          <description>Sub Oscillation Circuit Power Supply Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x04</resetValue>
          <resetMask>0x06</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ISUBSEL" -->
            <field>
              <name>ISUBSEL</name>
              <description>Sub oscillation circuit current setting bits</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCK_CTL" -->
        <register>
          <name>RCK_CTL</name>
          <description>Sub Clock Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTCCKE" -->
            <field>
              <name>RTCCKE</name>
              <description>RTC clock control bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PMD_CTL" -->
        <register>
          <name>PMD_CTL</name>
          <description>RTC Mode Control Register</description>
          <addressOffset>0x700</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTCE" -->
            <field>
              <name>RTCE</name>
              <description>RTC mode control bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WRFSR" -->
        <register>
          <name>WRFSR</name>
          <description>Deep Standby Return Cause Register 1</description>
          <addressOffset>0x704</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WLVDH" -->
            <field>
              <name>WLVDH</name>
              <description>Low-voltage detection reset return bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WINITX" -->
            <field>
              <name>WINITX</name>
              <description>INITX pin input reset return bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WIFSR" -->
        <register>
          <name>WIFSR</name>
          <description>Deep Standby Return Cause Register 2</description>
          <addressOffset>0x708</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WUI3" -->
            <field>
              <name>WUI3</name>
              <description>WKUP pin input return bit 3</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI2" -->
            <field>
              <name>WUI2</name>
              <description>WKUP pin input return bit 2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI1" -->
            <field>
              <name>WUI1</name>
              <description>WKUP pin input return bit 1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI0" -->
            <field>
              <name>WUI0</name>
              <description>WKUP pin input return bit 0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WLVDI" -->
            <field>
              <name>WLVDI</name>
              <description>LVD interrupt return bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WRTCI" -->
            <field>
              <name>WRTCI</name>
              <description>RTC interrupt return bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
